{"recipes": {"1": {"name": "One Minute Muffin", "description": "This flax muffin is quick, vertsatile (just mix in other goodies), and only makes one at a time, so you've got no huge tray to tempt you. Custom muffins every morning!", "image": "one-minute-muffin.jpg", "recipeYield": "", "recipeIngredient": ["1⁄4 cup flax seed meal", "1⁄2 teaspoon baking powder", "1 teaspoon cinnamon", "1 egg", "1 teaspoon oil", "sugar to taste (or honey, stevia)"], "recipeInstructions": [{"text": "Mix all ingredients in a coffee mug."}, {"text": "Micorowave for one minute on high."}], "totalTime": "None", "slug": "one-minute-muffin", "categories": [], "tags": ["breakfast"], "dateAdded": "{TinyDate}:20210112", "notes": [], "rating": 0, "orgURL": null, "extras": {}}, "2": {"name": "Banana Bread", "description": "From Angie's mom", "image": "banana-bread.jpg", "recipeYield": "", "recipeIngredient": ["4 bananas", "1/2 cup butter", "1/2 cup sugar", "2 eggs", "2 cups flour", "1/2 tsp baking soda", "1 tsp baking powder", "pinch salt", "1/4 cup nuts (we like pecans)"], "recipeInstructions": [{"text": "Beat the eggs, then cream with the butter and sugar"}, {"text": "Mix in bananas, then flour, baking soda/powder, salt, and nuts"}, {"text": "Add to greased and floured pan"}, {"text": "Bake until brown/cracked, toothpick comes out clean"}], "totalTime": "None", "slug": "banana-bread", "categories": [], "tags": ["breakfast", " baking"], "dateAdded": "{TinyDate}:20210112", "notes": [], "rating": 0, "orgURL": null, "extras": {}}, "3": {"name": "Pasta With Mushrooms and Cashew Cream", "description": "Might you mistake this vegan cream for actual alfredo sauce? Maybe. Maybe not. It’s delicious either way.", "image": "pasta-with-mushrooms-and-cashew-cream.jpg", "recipeYield": "4 Servings", "recipeIngredient": ["1 cup cashews", "4 Tbsp. (or  more) extra-virgin olive oil, divided", "6 oz. maitake mushrooms, torn into  bite-size pieces", "6 oz. shiitake mushrooms, stems removed, torn into bite-size pieces", "Kosher salt", "1 medium leek, white and pale green parts only, halved lengthwise, thinly sliced crosswise", "2 medium shallots, finely chopped", "2 garlic cloves, thinly sliced", "12 oz. spaghetti or other long pasta", "2 Tbsp. nutritional yeast", "2 Tbsp. finely chopped parsley", "½ lemon", "Freshly ground black pepper"], "recipeInstructions": [{"text": "Preheat oven to 350°. Toast cashews on a rimmed baking sheet, tossing halfway through, until golden brown, 7–9 minutes. Let cool."}, {"text": "Heat 2 Tbsp. oil in a large Dutch oven or other heavy pot over medium-high. Arrange half of mushrooms in a single layer in pot and cook, undisturbed, until edges are brown and starting to crisp, about 3 minutes. Give mushrooms a good toss, then continue to cook, tossing occasionally, until all sides are brown and crisp, about 5 minutes more. Using a slotted spoon, transfer mushrooms to a plate; season with salt. Repeat with remaining 2 Tbsp. oil, remaining mushrooms, and more salt."}, {"text": "Reduce heat to medium-low and return all of the mushrooms to same pot. Add leeks, shallots, and garlic and cook, stirring often and adding another 1 Tbsp. oil if pan looks dry, until leeks and shallots are translucent and softened, about 4 minutes. Remove from heat."}, {"text": "Meanwhile, cook pasta in a large pot of boiling salted water, stirring occasionally, until very al dente, about  2 minutes less than package directions (the pasta will finish cooking in the pan). Drain pasta, reserving ¾ cup pasta cooking liquid."}, {"text": "Blend cashews, nutritional yeast, and pasta cooking liquid in a blender until very creamy. Set cashew cream aside."}, {"text": "Return drained pasta to pot with mushroom mixture and add reserved cashew cream. Place over medium heat and cook, stirring well to coat, until pasta is al dente, about 3 minutes. Remove from heat. Add parsley and squeeze in juice from lemon half. Toss well to incorporate."}, {"text": "Divide pasta evenly among shallow bowls or plates and top with several grinds of pepper."}], "totalTime": "None", "slug": "pasta-with-mushrooms-and-cashew-cream", "categories": [], "tags": [], "dateAdded": "{TinyDate}:20210111", "notes": [], "rating": 0, "orgURL": "https://www.bonappetit.com/recipe/pasta-with-mushrooms-and-cashew-cream", "extras": {}}, "4": {"name": "New York Strip", "description": "Cooking a steak in a water bath is the ultimate, both in terms of flavor and laziness. Dial in a precise temperature, then go take a nap.", "image": "new-york-strip.jpg", "recipeYield": "", "recipeIngredient": ["NY Strip Steak(s)", "salt to taste"], "recipeInstructions": [{"text": "Bag the steak(s) and drop into 140° sous vide bath for 2 hours (or consult this handy [ChefSteps chart](https://s3.amazonaws.com/chefsteps/static/ChefSteps-SousVideReference.pdf))"}, {"text": "Pull from the bag, pat dry"}, {"text": "Sear in a scorching hot pan (butter + herb optional)"}, {"text": "Slice on a bias and sprinkle with sea salt"}], "totalTime": "None", "slug": "new-york-strip", "categories": [], "tags": ["mains", " meat"], "dateAdded": "{TinyDate}:20210112", "notes": [], "rating": 0, "orgURL": null, "extras": {}}, "5": {"name": "Detroit-Style Pepperoni Pizza", "description": "So you want to make pizza, but it’s your first time. This Detroit-style pizza from Bryan Ford, which uses a half-batch of his Master Dough, is perfect for beginners because you don’t have to shape the dough or wrangle a hot pizza stone. If you don’t have a Detroit pizza pan (its deep sides and black anodized aluminum help achieve a crust that’s fluffy on the inside but crisp all around), that’s okay: Use a 13x9\" baking pan or two 8x8\" baking pans.", "image": "detroit-style-pepperoni-pizza.jpg", "recipeYield": "Makes 1 large or 2 small", "recipeIngredient": ["Extra-virgin olive oil (for pan)", "Bread flour (for surface)", "½ batch (360 g) Master Bread Dough", "8 oz. low-moisture mozzarella or brick cheese", "¾ cup store-bought marinara sauce", "4 oz. pepperoni, sliced", "½ tsp. dried oregano", "½ cup (lightly packed) basil leaves"], "recipeInstructions": [{"@type": "HowToStep", "text": "To make this recipe, start by preparing a half-batch of the Master Bread Dough."}, {"@type": "HowToStep", "text": "Lightly brush Detroit-style pizza pan, 13x9\" baking pan, or two 8x8\" pans with extra-virgin olive oil. Lightly flour work surface with bread flour and turn ½ batch (360 g) Master Bread Dough out onto surface. If using a Detroit-style pizza pan or a 13x9\" pan, pull edges of dough into the center, then turn over and hold opposite sides of the dough with your hands so the sides of your pinkies are touching the surface and rotate dough, gently working it into a round as you go. If using two 8x8\" pans, divide dough in half and form using the same method as above. Gently transfer dough to prepared pan. Rub dough with oil and cover with a kitchen towel. Let rise in a warm, draft-free spot until dough expands a bit and is smooth and more pliable, about 1 hour."}, {"@type": "HowToStep", "text": "Meanwhile, cut 8 oz. low-moisture mozzarella or brick cheese into small cubes. You should have 2 heaping cups."}, {"@type": "HowToStep", "text": "Place a rack in middle of oven; preheat to 450°. Dimple dough with your fingers, gently pushing out to edges of pan. Scatter cheese evenly over dough all the way to the edges. Spoon ¾ cup store-bought marinara sauce over pizza in three even rows. Next, distribute 4 oz. pepperoni, sliced, evenly over sauce. Sprinkle with ½ tsp. dried oregano."}, {"@type": "HowToStep", "text": "Bake pizza until crust is deep golden brown, 35–40 minutes. (You can also check doneness with an instant-read thermometer. It should register 190° when inserted into a thick part of the crust.) Remove from oven and top with ½ cup (lightly packed) basil leaves. Let cool in pan 5 minutes before slicing."}], "totalTime": "None", "slug": "detroit-style-pepperoni-pizza", "categories": [], "tags": [], "dateAdded": "{TinyDate}:20210112", "notes": [], "rating": 3, "orgURL": "https://www.bonappetit.com/recipe/detroit-style-pepperoni-pizza", "extras": {}}, "6": {"name": "Crockpot Buffalo Chicken", "description": "{'This is a party favorite, perfect for a Super Bowl or a game night. It takes a long time, but like most slow cooker recipes, is easy as hell. Bonus': 'guests love it.'}", "image": "crockpot-buffalo-chicken.jpg", "recipeYield": "", "recipeIngredient": ["6-8 chicken breasts", "1 packet ranch mix", "1 bottle Frank's Red Hot", "1 stick of butter"], "recipeInstructions": [{"text": "Add all the above into a crockpot, cook on low for 6-8 hours"}, {"text": "Shred chicken when soft"}, {"text": "Serve with pickles and Hawaiian rolls"}], "totalTime": "None", "slug": "crockpot-buffalo-chicken", "categories": [], "tags": ["mains", " grill", " party"], "dateAdded": "{TinyDate}:20210112", "notes": [], "rating": 0, "orgURL": null, "extras": {}}, "7": {"name": "Buttery Kimchi Chicken", "description": "This spicy and sweet, slightly nutty, and creamy stew from developer Sunny Lee is worth the tending (and time) it requires over the stove.", "image": "buttery-kimchi-chicken.jpg", "recipeYield": "6-8 servings", "recipeIngredient": ["1 cup plain whole-milk Greek yogurt", "4 garlic cloves, finely chopped", "1 2\" piece ginger, peeled, finely chopped", "3 Tbsp. gochugaru (coarse Korean red pepper powder)", "1 Tbsp. fish sauce", "1 Tbsp. Diamond Crystal or 1¾ tsp. Morton kosher salt", "1 tsp. freshly ground black pepper", "2 lb. skinless, boneless chicken thighs", "½ cup dried soybeans", "2 Tbsp. vegetable oil", "1 onion, sliced ½\" thick", "2 cups drained Napa cabbage kimchi, cut into 2\" pieces", "2 Tbsp. plus 1½ tsp. tomato paste", "1½ cups low-sodium chicken broth", "4 Tbsp. unsalted butter", "Cooked white rice (for serving)", "3 scallions, thinly sliced", "1 red chile (such as Fresno), thinly sliced", "Pickles (for serving; optional)"], "recipeInstructions": [{"text": "Mix yogurt, garlic, ginger, gochugaru, fish sauce, salt, and pepper in a medium bowl. Cut chicken thighs crosswise into thirds and add to bowl. Massage yogurt mixture into chicken until well coated. Cover and chill at least 1 hour and up to 3 hours."}, {"text": "Meanwhile, place soybeans in a medium saucepan and pour in 2 cups cold water; bring to a boil. Immediately drain soybeans and rinse under cold running water. Return to pot, pour in 1 cup cold water, and bring to a boil again. Immediately remove from heat and let cool slightly. Transfer soybeans and water to a blender and blend until a thick purée forms. (It’s okay if the soybeans are a bit chunky still; they’ll soften in the braise.) Set aside."}, {"text": "Heat oil in a large Dutch oven over medium-high. Working in 2 batches, remove chicken from marinade, letting any marinade that wants to cling stay on, and cook, stirring occasionally, until browned all over, 5–7 minutes per batch. Using a slotted spoon, transfer chicken to a plate as you go, leaving all the crunchy bits and oil in pot. Set any remaining marinade aside."}, {"text": "Reduce heat to medium-high. Combine onion, kimchi, tomato paste, and reserved marinade in same pot and cook, stirring and scraping up browned bits constantly to prevent burning, until onion is softened and tomato paste darkens slightly and begins to stick to bottom of pot, about 10 minutes. Return chicken, along with any juices collected on plate, to pot and stir in broth, butter, and reserved soybean purée. Bring to a simmer and cook until chicken is just cooked through, 10–15 minutes."}, {"text": "Divide rice among bowls and ladle chicken mixture over. Top with scallions and chile. Serve with pickles alongside if desired."}], "totalTime": "None", "slug": "buttery-kimchi-chicken", "categories": [], "tags": [], "dateAdded": "{TinyDate}:20210111", "notes": [], "rating": 0, "orgURL": "https://www.bonappetit.com/recipe/buttery-kimchi-chicken", "extras": {}}, "8": {"name": "Crispy Rice With Ginger-Citrus Celery Salad", "description": "To get the best texture, evenly distribute the rice in your pan and gently press down to flatten it. Don’t touch until you hear it crackle! ", "image": "crispy-rice-with-ginger-citrus-celery-salad.jpg", "recipeYield": "4 servings", "recipeIngredient": ["1 2\" piece ginger, peeled, finely grated", "1 small garlic clove, finely grated", "Juice of 1 orange", "2 tbsp. vegetable oil", "1Tbsp. coconut aminos or low-sodium soy sauce", "1 Tbsp. fresh lemon juice", "¼ tsp. toasted sesame oil", "Kosher salt", "1 medium head of broccoli", "6 Tbsp. (or more) vegetable oil, divided", "Kosher salt", "2 cups chilled cooked brown rice", "4 large eggs", "3 celery stalks, thinly sliced on a steep diagonal", "½ cup cilantro leaves with tender stems", "½ cup mint leaves", "Crushed red pepper flakes (for serving)"], "recipeInstructions": [{"text": "Whisk ginger, garlic, orange juice, vegetable oil, coconut aminos, lemon juice, and sesame oil in a small bowl; season with salt and set aside."}, {"text": "Trim about ½\" from woody end of broccoli stem. Peel tough outer layer from stem. Cut florets from stems and thinly slice stems about ½\" thick. Break florets apart with your hands into 1\"–1½\" pieces."}, {"text": "Heat 2 Tbsp. oil in a large nonstick skillet over medium. Working in 2 batches if needed, arrange broccoli in a single layer and cook, tossing occasionally, until broccoli is bright green and lightly charred around the edges, about 3 minutes. Transfer to a large plate."}, {"text": "Pour 2 Tbsp. oil into same pan and heat over medium-high. Once you see the first wisp of smoke, add rice and season lightly with salt. Using a spatula or spoon, press rice evenly into pan like a pancake. Rice will begin to crackle, but don’t fuss with it. When the crackling has died down almost completely, about 3 minutes, break rice into large pieces and turn over."}, {"text": "Add broccoli back to pan and give everything a toss to combine. Cook, tossing occasionally and adding another 1 Tbsp. oil if pan looks dry, until broccoli is tender and rice is warmed through and very crisp, about 5 minutes. Transfer mixture to a platter or divide among plates and set aside."}, {"text": "Wipe out skillet; heat remaining 2 Tbsp. oil over medium-high. Crack eggs into skillet; season with salt. Oil should bubble around eggs right away. Cook, rotating skillet occasionally, until whites are golden brown and crisp at the edges and set around the yolk (which should be runny), about 2 minutes."}, {"text": "Toss celery, cilantro, and mint with 3 Tbsp. reserved dressing and a pinch of salt in a medium bowl to combine."}, {"text": "Scatter celery salad over fried rice; top with fried eggs and sprinkle with red pepper flakes. Serve extra dressing alongside."}], "totalTime": "None", "slug": "crispy-rice-with-ginger-citrus-celery-salad", "categories": [], "tags": [], "dateAdded": "{TinyDate}:20210111", "notes": [], "rating": 0, "orgURL": "https://www.bonappetit.com/recipe/crispy-rice-with-ginger-citrus-celery-salad", "extras": {}}, "9": {"name": "Crispy Carrots", "description": "This is another recipe we saw on Jamie Oliver's TV show, and we can't stop making it. It's perfect for parties, and pairs well with any rich dip (we've been doing greek yogurt topped with hot sauce and tahini). We've also rolled things other than carrots, changed the flavors, made news dips— go wild!", "image": "crispy-carrots.jpg", "recipeYield": "", "recipeIngredient": ["1 lb carrot sticks (or baby carrots)", "2 oranges (or any citrus)", "2 tbsp butter", "1 package phyllo dough", "1/2 cup honey", "sesame seeds to top", "vegetable oil"], "recipeInstructions": [{"text": "Start by parboiling your carrots in 2 cups of water (means party boil)."}, {"text": "Zest and juice the oranges."}, {"text": "When the carrots are jussst soft, drain the water. Add the butter, the zest, and the orange juice. Simmer until thick and declious. It's fine (and good) if the carrots are still a bit undercooked (we're going to bake them next)."}, {"text": "Unroll the phyllo dough and cut it into three equal sections. With a brush, oil the top of each sheet."}, {"text": "Roll a carrot with a single section of phyllow dough, place on a baking sheet. Repeat and repeat and repeat."}, {"text": "When a full baking sheet is ready, brush the top of each roll with a little oil. Don't worry about placing them too far about, they won't raise much (at all)."}, {"text": "Bake according to your phyllo dough box."}, {"text": "With 5 minutes left, brush the top of each roll with honey, then sprinkle with sesame seeds."}], "totalTime": "None", "slug": "crispy-carrots", "categories": [], "tags": ["veg", " party"], "dateAdded": "{TinyDate}:20210112", "notes": [], "rating": 0, "orgURL": null, "extras": {}}, "10": {"name": "Downtown Marinade", "description": "This is my go-to marinade for everything from steaks to shrimp to fajitas to pork. Seriously, if I'm cooking or grilling meat, there's a good chance this is what it's soaking in. It's perfect for \"street meat\" aka cart or truck, like tacos and wraps and kebabs and skewers and everything in between. Start with this base, add spice or herb as desired.", "image": "downtown-marinade.jpg", "recipeYield": "", "recipeIngredient": ["1 cup Italian dressing", "1/4 cup soy sauce", "1/4 cup chili paste (like [sambal oelek](https://amzn.to/2NuqquF))", "1/4 sugar", "dash hot sauce (like Texas Champagne or Yellowbird)"], "recipeInstructions": [{"text": "Mix everythiing in a large zip bag (or bowl)"}, {"text": "Toss meat and let sit (from 1-36hr)"}], "totalTime": "None", "slug": "downtown-marinade", "categories": [], "tags": ["party", " meat"], "dateAdded": "{TinyDate}:20210112", "notes": [], "rating": 0, "orgURL": null, "extras": {}}, "11": {"name": "Salt & Vinegar Potatoes", "description": "This recipe [popped up](https://www.nigella.com/recipes/salt-and-vinegar-potatoes) via Google auto suggestion, probably because I love chips, and it's a super pairing for a nice roast or bird. Adjust your amount of potatoes and oil/butter to your serving size and taste.", "image": "salt-vinegar-potatoes.jpg", "recipeYield": "", "recipeIngredient": ["small potatoes", "splash of oil/butter", "splash of vinegar", "dash of salt"], "recipeInstructions": [{"text": "Start by boiling or steaming your potatoes. When they are approaching fork tender, pull them out and smash each one. Don't mash them, just crush each potato until it just starts to crack."}, {"text": "In a baking pan, add a bit of butter and olive oil (to taste and/or diet) and bake at 400° for a few minutes or until it's nice and hot. Toss the potatoes in the hot oil."}, {"text": "Bake and then broil at 400° until the potatoes are brown and then skins are crisp."}, {"text": "Toss in a splash of vinegar (I like plain white, some use apple cider or red wine vinegar) and a pinch of good sea salt."}], "totalTime": "None", "slug": "salt-vinegar-potatoes", "categories": [], "tags": ["sides", " veg"], "dateAdded": "{TinyDate}:20210112", "notes": [], "rating": 0, "orgURL": null, "extras": {}}, "12": {"name": "Mushroom Risotto", "description": "Risotto is one of those recipes that sound tough but really isn't that tricky (but is totally tasty). This recipe is a mash between a [Jamie Oliver](https://www.jamieoliver.com/recipes/rice-recipes/grilled-mushroom-risotto/) method and a [Tasty 101 video](https://tasty.co/recipe/mushroom-risotto). Jamie asked for dried mushrooms (proved to be hard to find and expensive here) and Tasty didn't have enough mushroom punch (so we added back the roasted topper). The best of both worlds, and easier than I've previously imagined!", "image": "mushroom-risotto.jpg", "recipeYield": "", "recipeIngredient": ["10oz shitake mushrooms (we usually buy two 5oz grocery packages)", "1 cup arborio rice", "2 cups chicken stock", "4 tbsp butter (halved)", "1 small onion, diced", "6 cloves garlic", "1.5 cups white wine", "1 cup beer (drink the rest)", "half a lemon", "1 cup fresh grated parmesan cheese, plus more for serving", "sprig of parsley (or your favorite herb)", "salt", "pepper"], "recipeInstructions": [{"text": "Add the chicken stock, 1 cup white wine, and 1 cup beer to a stock pock and bring to a simmer (4 cups total). Reduce heat or set aside."}, {"text": "Add 2 tbsp butter, garlic, and onions to a deep pan and cook until translucent (a couple minutes). Add one package (or half) of your mushrooms and cook down. Salt and pepper to taste (small dash of salt, hearty crack of pepper for me, please)."}, {"text": "Add the rice into the pan and toss to coat. Toast for a few minutes."}, {"text": "Add the remaining white wine and juice from half a lemon to deglaze the pan, scraping up all the good bits."}, {"text": "Add a large ladle (or two) of the hot stock mixture into the rice pan. Here's where we get patient. Cook the stock down (near dry) before adding another ladle. Repeat."}, {"text": "Continue to add a ladle at a time, letting it fully absord while stirring, until the stock is gone or the rice is tender. Fair game to taste the rice a few times in search of the perfect tenderness."}, {"text": "Meanwhile, let's roast our other pack of fresh mushrooms. Get the remaining half on a sheet pan and under a 450° broiler. Keep an eye on them but cook til crispy and brown on the edges."}, {"text": "When the rice is tender and the mushrooms in the oven are crisp, stir your parmesan and remaining 2tbps butter into the rice. Plate your risotto and top with our roasted mushrooms, our herb, more parmesan, and a crack of black pepper."}], "totalTime": "None", "slug": "mushroom-risotto", "categories": [], "tags": ["mains", " veg"], "dateAdded": "{TinyDate}:20210112", "notes": [], "rating": 0, "orgURL": null, "extras": {}}, "13": {"name": "Nilla Wafer French Toast", "description": "From a weird Sunday morning when I realized we didn't have bread. Solid hitter. Served with [Treehive](https://amzn.to/2QBpGCH) Syrup, my new favorite breakfast obsession (it's mixed with honey, vanilla, and cinnamon, oof).", "image": "nilla-wafer-french-toast.jpg", "recipeYield": "", "recipeIngredient": ["4 eggs", "1/4 cup heavy cream", "2 tsp vanilla", "sprinkle of sugar", "4 cups Nilla Wafers Minis"], "recipeInstructions": [{"text": "Beat the eggs, heavy cream, vanilla, and sugar."}, {"text": "Arrange the nillas in a few flat layers in a baking dish."}, {"text": "Pour egg mixture over nillas. Let soak while oven preheats to 350°. Top with shake of cinnamon sugar."}, {"text": "Bake until egg has set (it'll fluff up a bit)"}], "totalTime": "None", "slug": "nilla-wafer-french-toast", "categories": [], "tags": ["breakfast", " baking"], "dateAdded": "{TinyDate}:20210112", "notes": [], "rating": 0, "orgURL": null, "extras": {}}, "14": {"name": "Roasted Okra", "description": "I love me some okra, but prep is usually enough to avoid making it. This simple dish requires only a single cut per pod and a dash of seasoning- that's it.", "image": "roasted-okra.jpg", "recipeYield": "", "recipeIngredient": ["1 bunch of okra", "salt, pepper, etc to taste"], "recipeInstructions": [{"text": "Wash the okra dang good"}, {"text": "Slice in half lengthwise"}, {"text": "Toss okra and seasoning on baking sheet (salt + pepper is great, I also really like Simply Asia spicy hibachi seasoing I found at HEB for like $2)"}, {"text": "Roast under the broiler for 10-15 mins. Keep an eye on it and pull it when the tips start to blacken."}], "totalTime": "None", "slug": "roasted-okra", "categories": [], "tags": ["sides", " vegetables"], "dateAdded": "{TinyDate}:20210112", "notes": [], "rating": 0, "orgURL": null, "extras": {}}, "15": {"name": "Mississippi Pot Roast", "description": "This is the recipe that rocked reddit, coming our way via [Today](https://www.today.com/today/amp/tdna199419) (believe it or not). It takes just minutes with almost no prep (use a slow cooker liner for no cleanup), and the leftovers can be used for sandwiches or nachos or eggs. If you like a thicker gravy, combine the dripping with flour/starch, or just enjoy the thinner jus.", "image": "mississippi-pot-roast.jpg", "recipeYield": "", "recipeIngredient": ["3-4 lbs chuck roast", "1 packet ranch mix", "1 packet au jus gravy mix", "1 stick butter", "1 jar pepperoncinis"], "recipeInstructions": [{"text": "In your slow cooker, add the roast and top with both packet mixes, a stick of butter (sliced into a few chunks), and a jar of pepperoncini peppers (the more the better, drained)"}, {"text": "Cook for 8 hours on low"}, {"text": "Serve with salt & vinegar potatoes"}], "totalTime": "None", "slug": "mississippi-pot-roast", "categories": [], "tags": ["mains", " crock pot"], "dateAdded": "{TinyDate}:20210112", "notes": [], "rating": 0, "orgURL": null, "extras": {}}, "16": {"name": "Tamarind Chicken Thighs With Collard Greens Salad", "description": "Tamarind concentrate gives this chicken its sticky, glossy quality, not to mention its sweet-and-sour flavor.", "image": "tamarind-chicken-thighs-with-collard-greens-salad.jpg", "recipeYield": "4 servings", "recipeIngredient": ["8 skin-on, bone-in chicken thighs  (about 2½ lb.), patted dry", "Kosher salt", "2 serrano chiles, coarsely chopped", "1 2\" piece ginger, peeled,  chopped", "3 garlic cloves", "⅓ cup tamarind concentrate", "3 Tbsp. coconut aminos", "2 Tbsp. agave nectar", "2 tsp. ground cinnamon", "1 tsp. ground nutmeg", "½ cup plus 3 Tbsp. fresh orange juice (from about 2 oranges)", "3 Tbsp. extra-virgin olive oil, divided", "2 medium Japanese sweet potatoes or other sweet potatoes (about  1 lb.), scrubbed, sliced into 1/8\"–1/4\"-thick rounds", "Half a bunch collard greens (about 6 oz.), stems removed, leaves cut or torn into bite-size pieces", "Freshly ground black pepper"], "recipeInstructions": [{"text": "Preheat oven to 375°. Place chicken in a large bowl and season all over with salt; set aside."}, {"text": "Blend chiles, ginger, garlic, tamarind concentrate, coconut aminos, agave, cinnamon, nutmeg, and ½ cup orange juice in a blender until smooth. Transfer to a small saucepan and place over medium heat. Cook, stirring often, until glaze is sticky and easily coats a spoon, 6–8 minutes. Let cool. Pour glaze over chicken and toss to coat."}, {"text": "Pour 2 Tbsp. oil into a large skillet and, using tongs, arrange chicken, skin side down, in pan, leaving excess glaze behind in bowl. Cook, undisturbed, over medium heat, until skin is browned and crisp, 10–12 minutes. Transfer chicken to a plate."}, {"text": "Let skillet cool 5 minutes, then arrange sweet potatoes in an even, slightly overlapping layer in pan. Season with salt and add 2 Tbsp water. Place chicken, skin side up, on top. Transfer pan to oven and roast until chicken is cooked through and juices run clear when flesh is pierced with the tip of a small knife, 10–12 minutes. Let rest in pan 10 minutes."}, {"text": "While the chicken is resting, toss collard greens, remaining 3 Tbsp. orange juice, and remaining 1 Tbsp. oil in a large bowl to combine; season with a pinch of salt and a few grinds of pepper. Lightly massage greens with your hands to soften slightly."}, {"text": "Serve chicken and sweet potatoes with collard greens salad alongside."}], "totalTime": "None", "slug": "tamarind-chicken-thighs-with-collard-greens-salad", "categories": [], "tags": [], "dateAdded": "{TinyDate}:20210111", "notes": [], "rating": 0, "orgURL": "https://www.bonappetit.com/recipe/tamarind-chicken-thighs-with-collard-greens-salad", "extras": {}}, "17": {"name": "Cauliflower Cacciatore", "description": "We first discovered this dish at [Arlo Grey](https://www.thelinehotel.com/austin/food-drink/) in Downtown Austin, and since, it's taken on a life of its own. We've cooked it a number of times and it's slowly evolved (mainly to become easier to cook, if you can believe it). It's one of our favorite vegetarian dishes and can easily swing vegan (just replace the dairy with something like hummus).\nIt's vegetables that eat like a full-on meat lasagna. Dang.", "image": "cauliflower-cacciatore.jpg", "recipeYield": "", "recipeIngredient": ["1 head of cauliflower", "1lb mini sweet peppers", "1 yellow onion, diced", "5oz mild goat cheese (we like Chavrie brand)", "5oz sour cream", "jar of cacciatore sauce (we like Cookwell & Company)", "1 cup red wine", "croutons (we make our own)", "fresh cilantro"], "recipeInstructions": [{"text": "Start by pickling half your peppers. Chop all your peppers, put half in a jar, cover with vinegar (and whatever you like, spices, garlic, hot sauce). We're only looking for a quick pickle here, so do this, shake it up, and get back to the rest of the recipe."}, {"text": "Next, start roasting the cauliflower, around 350°, to your desired level of doneness. Keep it firm and you can call it a \"cauliflower steak\", cook it down hard and it'll eat more like a mash. If you're making your own croutons, add some bread cubes tossed in oil/salt/pepper around the roasting pan."}, {"text": "While the cauliflower roasts, stir the goat cheese and sour cream together (and whatever you like, spices, garlic, hot sauce). If it's too thick, thin it out with a bit of olive oil."}, {"text": "Cook the onion and remaining peppers (non-pickled!) in a high heat pan with some olive oil. When softened, add your jar of cacciatore sauce and a cup of red wine. Stir and bring to a simmer, let it go until it gets a bit thicker."}, {"text": "To assemble, plate a large dollop of our cream cheese spread, place half a cauliflower head on top, cover with a scoop of cacciatore sauce, top with croutons, cilantro, and our pickled peppers."}], "totalTime": "None", "slug": "cauliflower-cacciatore", "categories": [], "tags": ["mains", " veg"], "dateAdded": "{TinyDate}:20210112", "notes": [], "rating": 0, "orgURL": null, "extras": {}}, "18": {"name": "Marranitos Enfiestados", "description": "Rick Martinez’s take on the popular Mexican pig-shaped cookie goes all out with a ginger-spiced dough and tons of sprinkles.", "image": "marranitos-enfiestados.jpg", "recipeYield": "", "recipeIngredient": ["1½ cups (210 g) whole wheat flour", "1 Tbsp. ground cinnamon", "1 Tbsp. ground ginger", "1 tsp. ground allspice", "¼ tsp. ground cloves", "1 tsp. baking powder", "½ tsp. baking soda", "3¾ cups (469 g) all-purpose flour, plus more for dusting", "12 Tbsp. (1½ sticks) unsalted butter, room temperature, divided", "½ cup (100 g) plus 1 tsp. granulated sugar", "1¼ tsp. Diamond Crystal or ¾ tsp. Morton kosher salt, divided", "3 large eggs, room temperature", "2 tsp. vanilla extract, divided", "⅓ cup light agave syrup (nectar), honey, or light corn syrup", "½ cup (100 g) grated or granulated piloncillo or (packed) dark brown sugar", "⅓ cup robust-flavored (dark) molasses", "Nonstick vegetable oil spray", "Sanding sugar or sprinkles (for decorating)", "A 4\" pig-shaped cookie cutter"], "recipeInstructions": [{"@type": "HowToStep", "text": "Whisk whole wheat flour, cinnamon, ginger, allspice, cloves, baking powder, baking soda, and 3¾ cups (469 g) all-purpose flour in a medium bowl. Using an electric mixer on medium-high speed, beat 6 Tbsp. butter, ½ cup (100 g) granulated sugar, and half of salt in a large bowl, scraping down sides of bowl as needed, until light and creamy, about 3 minutes. Add 1 egg and 1 tsp. vanilla; beat to combine. Add agave and beat just until smooth. Reduce speed to low, add half of dry ingredients (if you have a scale, use it!), and beat to combine, scraping down sides of bowl as needed. Dough will be slightly sticky. Wrap in plastic; pat into a square about ¾\" thick. Chill at least 3 hours and up to 1 day."}, {"@type": "HowToStep", "text": "Clean bowl and beaters. With mixer on medium-high speed, beat piloncillo, remaining salt, and remaining 6 Tbsp. butter, scraping down sides of bowl as needed, until light and creamy, about 3 minutes. Add 1 egg and remaining 1 tsp. vanilla; beat until combined. Add molasses and beat until smooth. Reduce speed to low; beat in remaining dry ingredients, scraping down sides of bowl as needed. Wrap in plastic; pat into a square about ¾\" thick. Chill at least 3 hours and up to 1 day."}, {"@type": "HowToStep", "text": "Place racks in upper and lower thirds of oven; preheat to 350°. Line 3 baking sheets with parchment paper and lightly coat with nonstick spray. Cut both doughs into about ¾\" pieces. (Don’t worry about being super precise; spots will look better if pieces are different shapes and sizes.) Arrange about half of brown and white dough pieces, touching and alternating colors, in an even layer on a lightly floured piece of parchment. (Chill remaining dough while you work.) Roll out ¼\" thick. Punch out cookies with lightly floured cutter and transfer to prepared baking sheets, spacing ¾\" apart. Arrange scraps in a single layer so they are touching and cover with plastic; chill 10 minutes if soft. Roll out scraps and cut out more pigs. Repeat with remaining dough and scraps."}, {"@type": "HowToStep", "text": "Beat remaining egg and remaining 1 tsp. granulated sugar in a small bowl. Using your finger, rub egg on brown spots only (egg will darken the spots) and along edges of cookies. Sprinkle sanding sugar or sprinkles along the edges of cookies, gently pressing into dough to adhere. Chill 10 minutes."}, {"@type": "HowToStep", "text": "Working in batches, bake cookies, rotating baking sheets top to bottom and front to back halfway through, until puffed and light spots are golden, 10–12 minutes. Let cookies cool 10 minutes on baking sheets, then transfer to a wire rack. Let cool completely.\nDo ahead: Cookies can be made 2 days ahead. Store airtight at room temperature."}], "totalTime": "None", "slug": "marranitos-enfiestados", "categories": [], "tags": [], "dateAdded": "{TinyDate}:20210112", "notes": [], "rating": 4, "orgURL": "https://www.bonappetit.com/recipe/marranitos-enfiestados", "extras": {}}, "19": {"name": "Smashed Carrots", "description": "Generally, canned carrots are stinky and not worth eating. Butter and cheese changes that.", "image": "smashed-carrots.jpg", "recipeYield": "", "recipeIngredient": ["1 can carrots", "1 tbsp butter", "2 tbsp parmesan cheese", "salt & pepper to taste"], "recipeInstructions": [{"text": "Combine carrots and butter, heat through (yes, you can microwave)"}, {"text": "Mash carrots, adding parmesan when smooshy"}, {"text": "Salt and pepper how you like"}], "totalTime": "None", "slug": "smashed-carrots", "categories": [], "tags": ["sides", " vegetables"], "dateAdded": "{TinyDate}:20210112", "notes": [], "rating": 0, "orgURL": null, "extras": {}}, "20": {"name": "Pizzettes", "description": "Not to be confused with wafer-thin waffled pizzelles, this rich brownie-like cookie packed with warm spices is exactly the opposite.", "image": "pizzettes.jpg", "recipeYield": "Makes about 20", "recipeIngredient": ["¾ cup raw skin-on almonds", "1½ cups (188 g) all-purpose flour", "1 tsp. baking powder", "½ tsp. Diamond Crystal or ¼ tsp. Morton kosher salt", "½ cup (1 stick) unsalted butter", "¾ tsp. ground cinnamon", "½ tsp. ground cloves", "½ tsp. ground nutmeg", "½ cup (100 g) granulated sugar", "¼ cup Dutch-process cocoa powder", "1 large egg", "1 large egg yolk", "4 oz. bittersweet chocolate chips (about 1 heaping cup)", "1 tsp. finely grated lemon zest", "1 tsp. finely grated orange zest", "2 oz. bittersweet chocolate", "2 tsp. unsalted butter", "⅔ cup (75 g) powdered sugar", "Pinch of kosher salt"], "recipeInstructions": [{"@type": "HowToStep", "text": "Place racks in upper and lower thirds of oven; preheat to 350°. Toast almonds on a rimmed baking sheet, tossing once, until slightly darkened in color and fragrant, 7–10 minutes. Let cool, then finely chop. Set aside. Increase oven temperature to 375°."}, {"@type": "HowToStep", "text": "Meanwhile, whisk flour, baking powder, and salt in a medium bowl. Melt butter in a medium saucepan over medium heat. Stir in cinnamon, cloves, and nutmeg. Remove from heat and let sit 5 minutes to infuse."}, {"@type": "HowToStep", "text": "Whisk granulated sugar and cocoa powder in a large bowl. Pour in spiced butter, scraping pan so you don’t leave any spices behind, and whisk vigorously to combine. Add egg and egg yolk; whisk vigorously to combine. Mix in dry ingredients, then almonds, chocolate chips, lemon zest, and orange zest. Turn out onto a clean surface. Divide in half, then roll each half into a log about 1½\" wide. Flatten logs to 2\" wide and slice on a diagonal into 1\"-wide cookies. Divide between 2 parchment-lined baking sheets, spacing at least 1\" apart."}, {"@type": "HowToStep", "text": "Bake cookies, rotating baking sheets top to bottom and front to back halfway through, until firm around edges but still soft in the middle, 8–10 minutes. Let cool."}, {"@type": "HowToStep", "text": "Melt chocolate and butter in a small heatproof bowl set over a small saucepan of barely simmering water (do not let bowl touch water), stirring occasionally, or melt in a small microwave-safe bowl in a microwave in 20-second bursts, stirring between bursts. Add powdered sugar, salt, and 2 Tbsp. boiling water and whisk until glaze is smooth and glossy."}, {"@type": "HowToStep", "text": "Dip tops of cookies into glaze and let sit, glaze side up, on a wire rack until glaze is set, about 2 hours."}, {"@type": "HowToStep", "text": "Do ahead: Pizzettes can be made 5 days ahead. Store airtight at room temperature, or freeze up to 1 month."}], "totalTime": "None", "slug": "pizzettes", "categories": [], "tags": [], "dateAdded": "{TinyDate}:20210112", "notes": [], "rating": 0, "orgURL": "https://www.bonappetit.com/recipe/chocolate-pizzettes-cookies", "extras": {}}, "21": {"name": "Jalapeno Cornbread", "description": "This corny cornbread pairs perfectly with chili or a bowl of stew. Add corn to the batter and you'll never go back.", "image": "jalapeno-cornbread.jpg", "recipeYield": "", "recipeIngredient": ["1 box \"fiesta\" corn bread mix", "1 can of sweet corn", "1 cup sour cream", "pickled jalapeños to taste"], "recipeInstructions": [{"text": "Make the cornbread mix according to the box (usually needs eggs and milk)."}, {"text": "Add a full can or corn (a regular sized can) and the sour cream (1 cup)."}, {"text": "Pour into a large glass baking dish and top with jalapeños."}, {"text": "Bake a few mins longer than the box says (we've added a lot of liquid)."}], "totalTime": "None", "slug": "jalapeno-cornbread", "categories": [], "tags": ["sides", " bread", " spicy"], "dateAdded": "{TinyDate}:20210112", "notes": [], "rating": 0, "orgURL": null, "extras": {}}, "22": {"name": "Chicken Salad With Citrus and Chile Oil", "description": "With plenty of protein, a double punch of acid from citrus and vinegar, and a garlicky chili oil, this salad is made for dinner.", "image": "chicken-salad-with-citrus-and-chile-oil.jpg", "recipeYield": "4 servings", "recipeIngredient": ["3 skin-on, bone-in chicken breasts  (about 1½ lb. total)", "Kosher salt, freshly ground pepper", "2 Tbsp. plus ⅓ cup extra-virgin olive oil", "3 garlic cloves, thinly sliced", "2 tsp. paprika", "1 tsp. coriander seeds, coarsely crushed", "½ tsp. crushed red pepper flakes", "2 medium endive, leaves separated", "1 large head of radicchio, leaves  separated, torn if large", "4 satsumas or blood oranges or 3 medium oranges, peeled, sliced into rounds, seeds removed", "2 Tbsp. white wine vinegar or red wine vinegar", "2 tsp. toasted sesame seeds, lightly crushed"], "recipeInstructions": [{"text": "Preheat oven to 450°. Pat chicken breasts dry with paper towels; season on all sides with salt and pepper, then rub with 2 Tbsp. oil."}, {"text": "Heat a large ovenproof skillet over medium-high. Arrange chicken, skin side down, in pan and cook, undisturbed, until skin is deep golden brown, about 3 minutes. Turn chicken over with tongs and transfer skillet to oven. Roast chicken until cooked all the way through, 15–17 minutes. Transfer to a cutting board and let cool 10 minutes."}, {"text": "Meanwhile, cook garlic and remaining ⅓ cup oil in a small skillet over medium heat, stirring occasionally, until garlic is fragrant and pale golden, about 4 minutes. Immediately pour garlic oil into a small bowl and stir in paprika, coriander seeds, and red pepper flakes; season with salt."}, {"text": "Cut chicken off the bone, then slice  ½\" thick; discard bones."}, {"text": "Toss endive, radicchio, and satsumas with vinegar and half of spiced garlic oil in a large bowl to combine; season salad with salt and pepper."}, {"text": "Divide salad among plates or shallow bowls; top with chicken and drizzle with more spiced garlic oil. Sprinkle sesame seeds over."}], "totalTime": "None", "slug": "chicken-salad-with-citrus-and-chile-oil", "categories": [], "tags": [], "dateAdded": "{TinyDate}:20210111", "notes": [], "rating": 0, "orgURL": "https://www.bonappetit.com/recipe/chicken-salad-with-citrus-and-chile-oil", "extras": {}}, "23": {"name": "Green Chile Stew", "description": "This is a simple one, consisting of a pre-made soup mix and whatever you've got around the kitchen (or campsite). Feel free to sub/swap/switch anything in the ingredient list— anything's fair game!", "image": "green-chile-stew.jpg", "recipeYield": "", "recipeIngredient": ["1 jar of [green chile stew mix](http://amzn.to/1KYXSjo)", "1lb ground chicken", "1 red onion", "1 green onion", "1 can corn"], "recipeInstructions": [{"text": "Start onions in pan, cook down"}, {"text": "Add chicken, corn"}, {"text": "Add stew mix"}, {"text": "Serve with croutons"}], "totalTime": "None", "slug": "green-chile-stew", "categories": [], "tags": ["sides", " soups"], "dateAdded": "{TinyDate}:20210112", "notes": [], "rating": 0, "orgURL": null, "extras": {}}, "24": {"name": "Broccoli Beer Cheese Soup", "description": "This recipe is inspired by one of my favorites, Gourmand's Beer Cheese Soup, which uses Shiner Bock. Feel free to use whatever you want, then go to [Gourmand's](http://lovethysandwich.com) to have the real thing.", "image": "broccoli-beer-cheese-soup.jpg", "recipeYield": "", "recipeIngredient": ["4 tablespoons butter", "1 cup diced onion", "1/2 cup shredded carrot", "1/2 cup diced celery", "1 tablespoon garlic", "1/4 cup flour", "1 quart chicken broth", "1 cup heavy cream", "10 ounces muenster cheese", "1 cup white white wine", "1 cup pale beer", "1 teaspoon Worcestershire sauce", "1/2 teaspoon hot sauce"], "recipeInstructions": [{"text": "Start with butter, onions, carrots, celery, garlic until cooked down"}, {"text": "Add flour, stir well, cook for 4-5 mins"}, {"text": "Add chicken broth, bring to a boil"}, {"text": "Add wine and reduce to a simmer"}, {"text": "Add cream, cheese, Worcestershire, and hot sauce"}, {"text": "Serve with croutons"}], "totalTime": "None", "slug": "broccoli-beer-cheese-soup", "categories": [], "tags": ["sides", " soups"], "dateAdded": "{TinyDate}:20210112", "notes": [], "rating": 0, "orgURL": null, "extras": {}}, "25": {"name": "Pork Steaks", "description": "Pork is called \"the other white meat\", but this sous vide technique is so dang good I'm gonna graduate it up to \"THE white meat\".", "image": "pork-steaks.jpg", "recipeYield": "", "recipeIngredient": ["pork shoulder (or other cheap cut)", "immerison circulator (we like the [Anova](http://www.amazon.com/gp/product/B00UKPBXM4/ref=as_li_tl?ie=UTF8&camp=1789&creative=390957&creativeASIN=B00UKPBXM4&linkCode=as2&tag=repl-20&linkId=XMRXWQ35OJNCZVGE))"], "recipeInstructions": [{"text": "Sous vide the pork at 140° for 24h"}, {"text": "Submerge bag into an ice bath to completely cool"}, {"text": "Cut and portion the cold roast into individual steaks"}, {"text": "Seal and save (fridge for 3 days, freezer for longer)"}, {"text": "To serve, reheat in bag, sear in sourching hot pan"}], "totalTime": "None", "slug": "pork-steaks", "categories": [], "tags": ["mains", " meat"], "dateAdded": "{TinyDate}:20210112", "notes": [], "rating": 0, "orgURL": null, "extras": {}}, "26": {"name": "Pace Pork", "description": "This recipe comes from Cody, a childhood neighbor and friend that my brother and I group chat message about food literally every day. Hey Cody!\nConsider this a starting point. This is totally one of those \"starter meats\" that you coud add to almost any dish.", "image": "pace-pork.jpg", "recipeYield": "", "recipeIngredient": ["pork shoulder (or loin)", "1 jar of Pace Picante"], "recipeInstructions": [{"text": "Combine the pork and Pace Picante in the crockpot"}, {"text": "Cook on slow for 8hrs or so (until it shreds)"}, {"text": "Eat on buns, on tortillas, with chips or nachos, etc"}], "totalTime": "None", "slug": "pace-pork", "categories": [], "tags": ["mains", " crock pot"], "dateAdded": "{TinyDate}:20210112", "notes": [], "rating": 0, "orgURL": null, "extras": {}}, "27": {"name": "One-Pot Chicken and Rice", "description": "We took loose inspiration from Hainanese chicken rice to create this weeknight-friendly dish that retains the comforting and fragrant qualities of the beloved original. Seek out the highest-quality basmati rice you can find (we recommend Daawat brand)—it will make a world of difference in yielding supremely fluffy, evenly cooked rice.", "image": "one-pot-chicken-and-rice.jpg", "recipeYield": "6 servings", "recipeIngredient": ["6 small skin-on, bone-in chicken thighs (about 3 lb.)", "¾ tsp. kosher salt, plus more", "2 large shallots, finely chopped", "8 garlic cloves, finely chopped", "1 2\" piece ginger, peeled, finely chopped", "2 cups high-quality basmati rice, rinsed", "2 whole star anise", "1 Tbsp. soy sauce", "½ cup creamy peanut butter", "2 Tbsp. soy sauce", "2 Tbsp. unseasoned rice vinegar", "5 tsp. Sriracha", "1 1\" piece ginger, peeled, finely chopped", "1½ tsp. honey", "1 English hothouse cucumber, halved lengthwise, thinly sliced on a diagonal", "1 cup cilantro leaves with tender stems"], "recipeInstructions": [{"@type": "HowToStep", "text": "Pat chicken dry and season all over with salt. Arrange, skin side down, in a cold, dry medium Dutch oven and set over medium heat. Cook, undisturbed, until skin is golden brown and crisp and easily releases from pot, 8–10 minutes. Slide thighs around to different spots (this will ensure even browning) and continue to cook until deeply browned, 3–5 minutes longer. Transfer chicken to a plate. Let pot cool 2 minutes."}, {"@type": "HowToStep", "text": "Set pot over medium-low heat; add shallots, garlic, and ginger and cook, stirring constantly, until very fragrant but not browned, about 2 minutes. Stir in rice and star anise and cook, stirring constantly, 1 minute. Stir in soy sauce, ¾ tsp. salt, and 3 cups water. Nestle chicken back into rice mixture in pot, arranging skin side up. Increase heat to medium and bring liquid to a simmer. Immediately cover pot, reduce heat to low, and cook 25 minutes. Remove from heat and let chicken and rice sit 10 minutes."}, {"@type": "HowToStep", "text": "While the chicken and rice are cooking, make the sauce. Whisk peanut butter, soy sauce, vinegar, Sriracha, ginger, honey, and ¼ cup warm water in a small bowl until smooth and pourable. If sauce still looks a little thick, continuing adding water until it reaches a drizzle-able consistency."}, {"@type": "HowToStep", "text": "Remove lid from pot and fluff rice with a fork. Pluck out and discard star anise. Serve chicken and rice with peanut sauce, cucumber, and cilantro alongside."}, {"@type": "HowToStep", "text": "Do Ahead: Sauce can be made 3 days ahead. Cover and chill."}], "totalTime": "None", "slug": "one-pot-chicken-and-rice", "categories": [], "tags": [], "dateAdded": "{TinyDate}:20210112", "notes": [], "rating": 0, "orgURL": "https://www.bonappetit.com/recipe/one-pot-chicken-and-rice#intcid=_bon-appetit-recipe-bottom-recirc_ee10e70e-8f95-4252-8065-3acbde6d4d31_similar2-3", "extras": {}}, "28": {"name": "Coffee-Hazelnut Biscotti", "description": "Embrace biscotti as the anti-gooey-chewy cookie that can be packed with coffee, chocolate, and nuts, and dunked in amaro, bourbon, or cold milk.", "image": "coffee-hazelnut-biscotti.jpg", "recipeYield": "Makes about 22", "recipeIngredient": ["⅔ cup blanched hazelnuts", "3 large eggs", "2 Tbsp. instant espresso powder or instant coffee powder", "2 cups (250 g) all-purpose flour", "2 tsp. baking powder", "1 tsp. Diamond Crystal or ½ tsp. Morton kosher salt", "½ cup (1 stick) unsalted butter, room temperature", "1 cup (200 g) sugar, plus more for sprinkling", "2 tsp. coffee extract or vanilla extract", "3 oz. coffee-flavored chocolate or semisweet chocolate, coarsely chopped"], "recipeInstructions": [{"@type": "HowToStep", "text": "Place racks in upper and lower thirds of oven; preheat to 350°. Toast hazelnuts on a rimmed baking sheet, tossing once, until golden brown, 8–10 minutes. Let cool, then very coarsely chop. Reduce oven heat to 325°."}, {"@type": "HowToStep", "text": "Separate yolk from 1 egg over a small bowl to catch egg white. Place yolk in another small bowl. Set egg white aside for brushing dough. Crack remaining 2 eggs into bowl with yolk. Add espresso powder and beat with a fork to combine and dissolve."}, {"@type": "HowToStep", "text": "Whisk flour, baking powder, and salt in a medium bowl. Using an electric mixer on medium speed, beat butter and 1 cup (200 g) sugar until light and creamy, about 2 minutes. Scrape down sides of bowl, then add egg yolk mixture and coffee extract; beat just to combine. Scrape down sides of bowl and beat until smooth. Add dry ingredients and mix on low speed to combine. Add hazelnuts and chocolate and mix just to evenly distribute. Divide dough evenly between 2 parchment-lined baking sheets. Run your hands under cold water, then shape each dough mound into a 5\" square about 1\" thick. Beat reserved egg white with a fork until foamy and brush over loaves (you won’t need all of it). Sprinkle very generously with sugar."}, {"@type": "HowToStep", "text": "Bake loaves, rotating baking sheets top to bottom and front to back halfway through, until firm in the center and starting to crisp at the edges, 30–35 minutes. (They will spread quite a bit as they bake.) Transfer baking sheets to wire racks; let loaves cool 15 minutes."}, {"@type": "HowToStep", "text": "Working one at a time, carefully transfer loaves to a cutting board. Using a serrated knife, slice ½\" thick. Arrange biscotti cut side down on baking sheets and bake, rotating baking sheets top to bottom and front to back halfway through, until dry and crisp, 30–35 minutes. Transfer baking sheets back to racks and let biscotti cool.\nDo ahead: Biscotti can be baked 1 week ahead. Store airtight at room temperature."}], "totalTime": "None", "slug": "coffee-hazelnut-biscotti", "categories": [], "tags": [], "dateAdded": "{TinyDate}:20210112", "notes": [], "rating": 3, "orgURL": "https://www.bonappetit.com/recipe/coffee-hazlenut-biscotti", "extras": {}}, "29": {"name": "Falafel-Hummus Plate", "description": "I first ate this 2019 at a restaurant in Brussels where I was together with my sister. It's an easy, very delicious plate that can be served in many different variations.", "image": "falafel-hummus-plate.jpg", "recipeYield": "", "recipeIngredient": ["falafel", "olives", "eggplant", "carrots", "sugar", "tahini", "hummus", "sesame seeds", "olive oil", "pomegranate seeds", "parsley", "vinegar", "salt, pepper, chili flakes"], "recipeInstructions": [{"text": "prepare Hummus and Falafel dough according to recipe"}, {"text": "cut eggplant into 1cm pieces, slice carrot in half a centimeter slices."}, {"text": "saute eggplant and carrot slice together in some oil, sugar"}, {"text": "carammelize some sugar in a pan, add eggplant and carrot slices. Sauté until soft."}, {"text": "Chop parsley and combine with pomegranate seeds and some vinegar to create a side salad"}, {"text": "form Falafel balls, touch into sesame seeds and fry until golden brown using some olive oil"}, {"text": "serve Falafel ontop of hummus aside olives, parsley salad, eggplant-carrot-mixture"}, {"text": "decorate using chili flakes and tahini"}], "totalTime": "None", "slug": "falafel-hummus-plate", "categories": [], "tags": ["vegetarian", " fast", " chickpeas"], "dateAdded": "{TinyDate}:20210112", "notes": [], "rating": 0, "orgURL": null, "extras": {}}, "30": {"name": "Shrimp and Cabbage Curry", "description": "Make this shrimp and cabbage curry vegetarian by skipping the shrimp and using cubed pumpkin or squash instead.", "image": "shrimp-and-cabbage-curry.jpg", "recipeYield": "4 servings", "recipeIngredient": ["1 red bell pepper, ribs and seeds  removed, coarsely chopped", "2 red Thai chiles or 1 small red Fresno chile, seeds removed if  desired, coarsely chopped", "1 lemongrass stalk, bottom third only, tough outer layers removed, finely chopped", "4 garlic cloves, smashed", "1 4\" piece ginger, peeled, finely  grated", "2 Tbsp. smoked paprika", "2 tsp. ground coriander", "1 tsp. ground cumin", "1 tsp. ground turmeric", "Kosher salt", "3 Tbsp. (or more) virgin coconut oil", "½ medium head of green cabbage, cut into 4 wedges through  root end", "1 13.5-oz. can unsweetened  coconut milk", "Kosher salt", "1 lb. large shrimp, shelled, deveined", "4 scallions, chopped", "2 tsp. finely grated lime zest", "2 Tbsp. fresh lime juice", "Small handful of torn tender herbs (such as cilantro, basil, and/or  mint)", "Lime wedges (for serving)"], "recipeInstructions": [{"text": "Blend red bell pepper, chiles, lemongrass, garlic, ginger, paprika, coriander, cumin, turmeric, and a couple of big pinches of salt in a blender until a smooth paste forms."}, {"text": "Heat oil in a large pot over medium-high. Cook cabbage until deeply browned on both cut sides, about  2 minutes per side. Transfer to a plate."}, {"text": "If pot looks dry, add another 1 Tbsp. oil. Add curry paste to pot (still over medium-high heat) and cook, stirring often, until paste is slightly darkened in color and beginning to stick to bottom of pot, about 5 minutes. Pour coconut milk and 2 cups water into pot and reduce heat to medium; season with salt. Cook, scraping up any curry paste stuck to pot until flavors come together and curry is slightly thickened, 10–12 minutes."}, {"text": "While the curry is cooking, coarsely chop cabbage."}, {"text": "Season shrimp with salt and add to curry. Cook, stirring, until shrimp are just cooked through, about 3 minutes. Remove pot from heat; stir in cabbage, scallions, and lime zest and juice."}, {"text": "Divide curry among bowls and top with herbs. Serve with lime wedges."}], "totalTime": "None", "slug": "shrimp-and-cabbage-curry", "categories": [], "tags": [], "dateAdded": "{TinyDate}:20210111", "notes": [], "rating": 0, "orgURL": "https://www.bonappetit.com/recipe/shrimp-and-cabbage-curry", "extras": {}}, "31": {"name": "Roasted Brussels Sprouts", "description": "A lot of places are doing dang good brussels lately, but none can touch [Salty Sow](http://saltysow.com/). They serve them fried, topped with pecorino and golden raisins. Yes, please.\nWe started trying to emulate it, but it's such a versatile dish, you can make it however you want. Consider this a loose guide.", "image": "roasted-brussels-sprouts.jpg", "recipeYield": "", "recipeIngredient": ["1 bunch of brussels, sliced thin", "2 tbsp olive oil", "(optional) grated hard cheese", "(optional) gold raisins or sweetened cranberries", "(optional) assorted veggies, sliced thin", "salt, pepper, etc to taste"], "recipeInstructions": [{"text": "Wash and thinly slice the brussels sprouts (or buy them pre-sliced at HEB or Central Market)"}, {"text": "Toss the brussels (+ optional veggies), olive oil, and salt + pepper on a baking sheet"}, {"text": "Roast under the broiler for 10-15 mins, keeping a close eye"}, {"text": "Remove from the oven when the edges just start to blacken"}, {"text": "Toss with optional ingredients (depending on how healthy you're feeling)"}], "totalTime": "None", "slug": "roasted-brussels-sprouts", "categories": [], "tags": ["sides", " vegetables"], "dateAdded": "{TinyDate}:20210112", "notes": [], "rating": 0, "orgURL": null, "extras": {}}, "32": {"name": "Tequila, Beer, and Citrus Cocktail", "description": "The holiday cocktail that takes you straight to the beach (and isn’t that where you want to be anyway?). ", "image": "tequila-beer-and-citrus-cocktail.jpg", "recipeYield": "Makes 1", "recipeIngredient": ["¾ oz. fresh grapefruit juice", "¾ oz. fresh lime juice", "½ oz. agave nectar", "2 Tbsp. red pepper jelly", "1½ oz. tequila blanco", "1 12-oz. chilled Mexican beer", "Lime wedge (for serving)"], "recipeInstructions": [{"@type": "HowToStep", "text": "Combine grapefruit juice, lime juice, agave, and jelly in a cocktail shaker filled with ice and shake until incorporated, 15–20 seconds. Add tequila and shake 10 seconds longer. Fill a tall glass to the top with ice. Pour in beer just to fill the glass halfway. Double-strain grapefruit mixture into glass; garnish with lime wedge."}], "totalTime": "None", "slug": "tequila-beer-and-citrus-cocktail", "categories": [], "tags": [], "dateAdded": "{TinyDate}:20210112", "notes": [], "rating": 0, "orgURL": "https://www.bonappetit.com/recipe/tequila-beer-and-citrus-cocktail", "extras": {}}, "33": {"name": "Ginger-Citrus Cookies", "description": "Blanching the citrus peel in several changes of boiling water removes bitterness while still leaving plenty of bright flavor behind.", "image": "ginger-citrus-cookies.jpg", "recipeYield": "Makes about 28", "recipeIngredient": ["2 cups 1\"–2\"-wide strips lemon, lime, orange, or grapefruit zest (pith removed)", "2 cups granulated sugar", "1 tsp. ground ginger", "½ tsp. ground cardamom", "½ tsp. ground cinnamon", "¼ tsp. ground cloves", "3½ cups all-purpose flour", "1 Tbsp. baking soda", "1 tsp. Diamond Crystal or ½ tsp. Morton kosher salt", "½ tsp. freshly ground white pepper", "10 Tbsp. unsalted butter, room temperature", "1 cup granulated sugar", "½ cup (packed) light brown sugar", "2 large eggs", "¾ cup mild-flavored (light) molasses"], "recipeInstructions": [{"@type": "HowToStep", "text": "Place citrus zest in a medium saucepan and pour in cold water to cover. Bring to a boil; drain. Repeat process 2 more times."}, {"@type": "HowToStep", "text": "Combine sugar and 2 cups water in same saucepan; bring to a boil, stirring to dissolve sugar. Add citrus zest and bring just to a simmer. Reduce heat to low and simmer very gently until peels are translucent, 30–45 minutes. Remove from heat and let citrus zest cool in syrup."}, {"@type": "HowToStep", "text": "Drain citrus zest and finely chop. Spread out on a rimmed baking sheet; let sit until dry."}, {"@type": "HowToStep", "text": "Preheat oven to 350°. Toast ginger, cardamom, cinnamon, and cloves in a small skillet over medium heat, stirring with a wooden spoon, until fragrant, about 2 minutes. Remove from heat."}, {"@type": "HowToStep", "text": "Sift toasted spices, flour, baking soda, salt, and white pepper into a medium bowl or onto a sheet of wax paper."}, {"@type": "HowToStep", "text": "Using an electric mixer on medium-high speed, beat butter and both sugars in a large bowl until light and fluffy, about 4 minutes. Add eggs one at a time, beating well after each addition and scraping down sides of bowl as needed. Beat in molasses. Gradually add dry ingredient in 2 batches, beating on low speed to incorporate after each addition. Stir in 1 cup candied citrus peel."}, {"@type": "HowToStep", "text": "Drop dough by rounded tablespoons between 2 parchment-lined baking sheets, spacing 2\" apart. Bake cookies until tops feel firm when lightly touched, 10–12 minutes. Let cool on baking sheets about 2 minutes, then transfer to a wire rack and let cool completely."}], "totalTime": "None", "slug": "ginger-citrus-cookies", "categories": [], "tags": [], "dateAdded": "{TinyDate}:20210112", "notes": [], "rating": 3, "orgURL": "https://www.bonappetit.com/recipe/ginger-citrus-cookies", "extras": {}}, "34": {"name": "Marinated Tofu With Brussels Sprouts and Farro", "description": "The soul of this recipe comes from the ginger and tamari marinade that gives a sweet and savory winter coat to the crispy tofu. ", "image": "marinated-tofu-with-brussels-sprouts-and-farro.jpg", "recipeYield": "4 servings", "recipeIngredient": ["1 cup semi-pearled farro or cracked freekeh, rinsed", "Kosher salt", "1 14-oz. block extra-firm tofu", "1 1½\" piece ginger, peeled, finely  grated", "2 Tbsp. tamari or low-sodium soy  sauce", "1 Tbsp. fish sauce", "1 tsp. ground cumin", "6 scallions, coarsely chopped", "12 oz. brussels sprouts, trimmed,  halved through stem end", "4 Tbsp. vegetable oil, divided½ lemon", "⅓ cup coarsely chopped parsley or cilantro"], "recipeInstructions": [{"text": "Preheat oven to 425°. Toast farro in a large wide pot over medium heat,  stirring often, until golden brown, about 4 minutes. Remove from heat and pour in cold water to cover grains by 1\"; season generously with salt. Set pot over medium-high heat and bring water to a boil. Reduce heat and simmer, skimming foam from surface, until grains are tender but still have some bite, 25–30 minutes. Drain farro and return to pot off heat; cover to keep warm."}, {"text": "While farro is cooking, cut tofu lengthwise to create 2 wide, flat slabs.  Pat dry with paper towels to remove as much moisture from surface as possible. Arrange in a single layer in a large shallow bowl."}, {"text": "Whisk ginger, tamari, fish sauce, and cumin in a small bowl to combine. Pour half of marinade over tofu and gently turn to coat evenly."}, {"text": "Toss scallions and brussels sprouts with 2 Tbsp. oil and remaining marinade on a large rimmed baking sheet to coat well; season with salt. Spread out vegetables to ensure everything cooks evenly and roast, tossing halfway through, until deeply browned in spots, 20–25 minutes."}, {"text": "Finely grate zest from lemon over vegetables, then squeeze juice over. Add parsley and toss well to combine."}, {"text": "Heat remaining 2 Tbsp. oil in a large nonstick skillet over medium-high. Working in batches if needed, cook tofu, undisturbed, until dark brown and very crisp, about 2 minutes. Carefully turn over and cook on other side until dark brown and very crisp, about 2 minutes. Transfer tofu to a cutting board and slice as desired."}, {"text": "Divide farro and tofu evenly among bowls. Scatter brussels sprouts mixture on top."}], "totalTime": "None", "slug": "marinated-tofu-with-brussels-sprouts-and-farro", "categories": [], "tags": [], "dateAdded": "{TinyDate}:20210111", "notes": [], "rating": 0, "orgURL": "https://www.bonappetit.com/recipe/marinated-tofu-with-brussels-sprouts-and-farro", "extras": {}}, "35": {"name": "Green Spaghetti", "description": "We saw this on Jamie Oliver's TV show and made it that night. He calls for **cavolo nero** as the greens, but dinosaur kale or spinach or any dark leafy green will do. The bigger the green, the easier it is to fish out of the boiling water, so keep that in mind.\nStart to finish this whole recipe takes about 10 minutes, but it's pretty rapid fire once you get stated. Have plates and an appetite standing by.", "image": "green-spaghetti.jpg", "recipeYield": "", "recipeIngredient": ["dried spaghetti", "giant bunch of dark greens (see notes)", "4 cloves of garlic", "1/4 cup parmesan cheese", "1.4 cup ricotta or queso fresco"], "recipeInstructions": [{"text": "Bring water to a boil and add spaghetti, greens, and whole garlic cloves"}, {"text": "Wilt the greens for a few minutes"}, {"text": "Use tongs to move greens and garlic to a blender, add fresh-grated parmesan, pulse for a few mins, add salt and pepper to taste"}, {"text": "Drain pasta, reserving a cup or so of the water"}, {"text": "Toss pasta in sauce, adding a splash of water to make everything happy"}, {"text": "Plate and top with freshly crumbled cheese and more cracked black pepper"}], "totalTime": "None", "slug": "green-spaghetti", "categories": [], "tags": ["mains", " pasta", " veg"], "dateAdded": "{TinyDate}:20210112", "notes": [], "rating": 0, "orgURL": null, "extras": {}}, "36": {"name": "Five Spice Popcorn Chicken", "description": "It’s easy to rely on take-out for some of our favorite Chinese dishes. However, with the right pantry staples, dishes like this Five Spice Popcorn Chicken can become part of your go-to arsenal of recipes. This crispy chicken is coated in a creamy, tangy sauce, made zesty with The Spice Hunter Chinese Five Spice, a blend of star anise, cloves, cinnamon, fennel, and black pepper.", "image": "five-spice-popcorn-chicken.jpg", "recipeYield": "Serves 4 People", "recipeIngredient": ["1 tablespoon soy sauce", "1 tablespoon sugar", "1 teaspoon The Spice Hunter® Chinese Five Spice Blend, plus more for serving", "1 clove garlic, finely grated", "1 1/2 pounds boneless skinless chicken thighs, cut into roughly 1-inch chunks", "⅓ cup cornstarch", "1 large egg, beaten", "¾ cup all-purpose flour", "Canola or vegetable oil, for frying", "Flaky sea salt", "Scallion, thinly sliced, for serving", "Sriracha mayonnaise, for serving, optional"], "recipeInstructions": [{"@type": "HowToStep", "text": "In a medium bowl, whisk the soy sauce with the sugar, Chinese Five Spice, and garlic. Add the chicken and toss to coat. Let marinate 15 minutes."}, {"@type": "HowToStep", "text": "Drain any excess marinade off of the chicken and toss the chicken with the cornstarch to coat. Once fully coated, add the beaten egg and toss to coat."}, {"@type": "HowToStep", "text": "In a large heavy bottomed pot, heat 1-inch of oil to 350."}, {"@type": "HowToStep", "text": "Place the flour in a large ziploc bag. Working in batches, transfer a few chicken pieces into the bag with the flour and toss to coat, then remove, leaving excess flour in the bag."}, {"@type": "HowToStep", "text": "Carefully place the breaded chicken in the hot oil and fry, turning occasionally, until golden and cooked through about 3 to 4 minutes."}, {"@type": "HowToStep", "text": "Using a slotted spoon or spider, transfer the cooked chicken to a paper towel lined plate. Season with salt and additional Chinese Five Spice seasoning. Repeat the flouring and frying with remaining chicken."}, {"@type": "HowToStep", "text": "Serve with scallions, more Chinese Five Spice Blend, and optional sriracha mayonnaise."}], "totalTime": "None", "slug": "five-spice-popcorn-chicken", "categories": [], "tags": [], "dateAdded": "{TinyDate}:20210112", "notes": [], "rating": 3, "orgURL": "https://www.bonappetit.com/recipe/five-spice-popcorn-chicken#intcid=_bon-appetit-recipe-bottom-recirc_3cad5ce9-734a-46f8-b503-78c33d2e7279_similar2-3", "extras": {}}, "37": {"name": "Green Seasoning Baked Cod", "description": "Herbaceous, aromatic, fresh, and—maybe most importantly—simple, this Trini-inspired recipe from Brigid Washington is just the cure for those January blues.", "image": "green-seasoning-baked-cod.jpg", "recipeYield": "4 servings", "recipeIngredient": ["¼ Vidalia or other sweet onion", "4 6-oz. skinless, boneless cod fillets", "1½ tsp. Diamond Crystal or ¾ tsp. Morton kosher salt, divided", "Freshly ground black pepper", "¼ cup plus 2 tsp. extra-virgin olive oil", "1 lime", "4 garlic cloves", "1 2\" piece ginger", "4–5 thyme sprigs", "1 small bunch cilantro", "2–4 scallions", "1 red bell pepper", "1 habanero chile", "Cooked brown rice or ramen noodles (for serving)"], "recipeInstructions": [{"text": "Preheat oven to 300°. Thinly slice ¼ Vidalia or other sweet onion with a chef’s knife and place in a medium baking dish. Place four 6-oz. skinless, boneless cod fillets on top of onion slices. Generously sprinkle fillets on both sides with 1 tsp. Diamond Crystal or ½ tsp. Morton kosher salt and season with freshly ground black pepper. Pour ¼ cup extra-virgin olive oil over, then finely grate zest from 1 lime on top; set lime aside. Turn fillets to coat. Let cod sit while you prepare remaining ingredients."}, {"text": "Smash, peel, and coarsely chop 4 garlic cloves. Peel one 2\" piece ginger with a spoon, then thinly slice; place in a small bowl. Cut slices into matchsticks; cut matchsticks into small cubes. Place garlic and ginger in a small bowl."}, {"text": "Pick leaves off 4–5 thyme sprigs and chop; discard stems. You should have about 1 Tbsp. chopped thyme. Coarsely chop leaves and tender stems from 1 small bunch cilantro until you have ½ cup (reserve remaining cilantro for another use); add herbs to bowl with garlic and ginger."}, {"text": "Trim and coarsely chop 2–4 scallions to yield about ⅓ cup and place in same bowl."}, {"text": "Slice 1 red bell pepper in half lengthwise and remove ribs and seeds; discard. Finely chop flesh and add to bowl. Slice 1 habanero chile in half lengthwise and remove ribs and seeds; discard. Finely chop half of chile; reserve remaining chile for another use. Add bell pepper and chile to bowl and toss all ingredients with your hands to combine."}, {"text": "Spoon mixture evenly over cod to completely cover. Slice reserved lime in half and squeeze juice over; sprinkle with remaining ½ tsp. Diamond Crystal or ¼ tsp. Morton kosher salt and drizzle with remaining 2 tsp. extra-virgin olive oil. Bake until fish is opaque and cooked through and red pepper and chile are softened, 25–35 minutes. Serve cod with cooked brown rice or ramen noodles."}], "totalTime": "None", "slug": "green-seasoning-baked-cod", "categories": [], "tags": [], "dateAdded": "{TinyDate}:20210111", "notes": [], "rating": 0, "orgURL": "https://www.bonappetit.com/recipe/green-seasoning-baked-cod", "extras": {}}, "38": {"name": "Huevos Rancheros con Rajas y Champiñones", "description": "For his take on this classic Mexican dish, which originated as a simple but hearty ranchers' breakfast, Rick Martinez adds a layer of cheesy sautéed poblanos and mushrooms to the tostada-egg-salsa trio.", "image": "huevos-rancheros-con-rajas-y-champinones.jpg", "recipeYield": "4-6 servings", "recipeIngredient": ["1 serrano chile", "16 oz. cherry tomatoes (about 3 cups)", "¼ onion", "¼ cup cilantro leaves with tender stems, plus more for serving", "3 tsp. Diamond Crystal or 1½ tsp. Morton kosher salt, divided, plus more", "1½ tsp. (or more) fresh lime juice", "8 oz. button mushrooms", "2 medium poblano chiles or any color bell peppers", "2 garlic cloves", "6 oz. white cheddar", "5 Tbsp. extra-virgin olive oil, divided", "4 large eggs", "4 tostadas"], "recipeInstructions": [{"text": "Make the salsa ranchera: Remove stem from 1 serrano chile (only use ½ if you don’t want your salsa spicy) and halve lengthwise. Heat a medium skillet, preferably cast iron, over high until you see wisps of smoke, about 2 minutes. Arrange serrano chile, skin side down, on one side of pan and add 16 oz. cherry tomatoes. Cook, leaving chile undisturbed and occasionally tossing tomatoes, until charred, 6–8 minutes. It is going to get a little smoky so turn on the vent and open a window. Transfer serrano chile and tomatoes to a blender or food processor. Reserve skillet."}, {"text": "Add ¼ onion, ¼ cup cilantro leaves with tender stems, and 1 tsp. Diamond Crystal or ½ tsp. Morton kosher salt to blender and blend on low speed (or pulse if using a food processor) until vegetables are broken up, about 30 seconds. Increase speed to medium-low and purée until salsa is almost smooth but some chunks remain. Don’t be tempted to blend on high or you will incorporate air into the salsa and it will look and taste more like a smoothie than a salsa. Transfer to a medium bowl and stir in 1½ tsp. fresh lime juice. Taste and season with more salt and add more lime juice if needed. Set aside until ready to serve."}, {"text": "Using a paper towel, brush off dirt from 8 oz. button mushrooms. Trim woody stems and discard. Cut mushrooms into quarters. Cut 2 medium poblano chiles or any color bell peppers in half lengthwise and remove stems, seeds, and ribs. Cut chiles into long thin strips about ¼\" thick. Use the side of a chef’s knife to lightly smash 2 garlic cloves, then peel and thinly slice. Grate 6 oz. white cheddar on the large holes of a box grater."}, {"text": "Head over to the stove with all of your prep work (gathering it on a rimmed baking sheet will make this easy!). Now, you’re ready to make the mushroom topping. Wipe out reserved skillet with a paper towel and heat 3 Tbsp. extra-virgin olive oil over medium-high. Arrange mushrooms in a single layer in skillet and cook, undisturbed, until brown underneath, about 3 minutes. Give mushrooms a toss and season with 1 tsp. Diamond Crystal or ½ tsp. Morton kosher salt. Continue to cook, tossing occasionally, until deep golden brown all over, 5–7 minutes longer. Using a slotted spoon, transfer to a small bowl, leaving oil behind."}, {"text": "Arrange poblano chiles in an even layer in same skillet and cook, undisturbed, until browned underneath, about 2 minutes. Add garlic and season with 1 tsp. Diamond Crystal or ½ tsp. Morton kosher salt. Cook, tossing occasionally, until lightly browned all over, 5–7 minutes longer. Add 3 Tbsp. water and cook, stirring occasionally, until water has evaporated, about 2 minutes. The water will soften the chiles and pull up all those tasty brown bits from the bottom of the pan."}, {"text": "Add mushrooms with any accumulated juices back to pan and toss until evenly distributed. Sprinkle cheese over in an even layer and remove skillet from heat. Cover (a baking sheet works great if you don’t have a lid that will work) and let sit 5 minutes for cheese to melt."}, {"text": "You are almost there; you just need to cook the eggs. Heat remaining 2 Tbsp. extra-virgin olive oil in a large nonstick skillet over medium-high. Crack 4 large eggs into skillet, leaving space around each one, and cook until whites are set and edges are crisp, about 4 minutes. Season with salt."}, {"text": "To serve, spoon cheesy mushroom mixture onto 4 tostadas, dividing evenly, and top each with an egg, then reserved salsa and some cilantro."}], "totalTime": "None", "slug": "huevos-rancheros-con-rajas-y-champinones", "categories": [], "tags": [], "dateAdded": "{TinyDate}:20210111", "notes": [], "rating": 0, "orgURL": "https://www.bonappetit.com/recipe/huevos-rancheros-con-rajas-y-champinones", "extras": {}}, "39": {"name": "Bon Appétit's Perfect Pizza", "description": "With the amount of love, time, and research that went into making what constitutes the “perfect” pizza, you’ll definitely want to share. Welcome to the best-ever excuse to invite people over for a pizza party.", "image": "bon-appetit-s-perfect-pizza.jpg", "recipeYield": "Makes one 10\"-diameter pie", "recipeIngredient": ["250 g Central Milling Organic High Mountain flour", "150 g freshly milled flour (from Central Milling Organic Steel Cut Cracked Wheat) or Central Milling Organic High Mountain flour or high-quality whole wheat flour", "30 g Diamond Crystal kosher salt", "600 g King Arthur all-purpose flour, plus more for dusting", "150 g sourdough starter", "50 g Frankie’s extra-virgin olive oil", "5 g fresh cake yeast, finely crumbled", "2 28-oz. cans Bianco DiNapoli whole peeled tomatoes", "3 thin slices of garlic (not 3 garlic cloves, thinly sliced!)", "2 Tbsp. Frankie’s extra-virgin olive oil", "¼ tsp. kosher salt", "1 oz. imported mozzarella di bufala (such as Antiche Bontà Mozarella di bufala Campana), torn into quarter-size pieces", "1 oz. fior di latte mozzarella, torn into quarter-size pieces", "2 Tbsp. extra-virgin olive oil, plus more", "4 oz. maitake mushrooms, torn into 1\" pieces", "Kosher salt, freshly ground pepper", "2 Calabrian chiles from a jar, coarsely chopped", "1 200 g ball Pizza Dough (see above)", "King Arthur all-purpose flour (for dusting)", "3 Tbsp. Pizza Sauce (see above)", "½ garlic clove, very thinly sliced", "4 oz. 2-year-aged Parmesan, coarsely grated", "6 basil leaves, torn", "1 lemon", "A Breville Pizzaiolo oven; a wooden pizza peel (no more than 10\" wide and ¼\" thick); a kitchen scale; a bench scraper; a food mill"], "recipeInstructions": [{"@type": "HowToStep", "text": "Mix High Mountain flour, freshly milled flour, salt, and 600 g all-purpose flour in the bowl of a stand mixer fitted with the dough hook just to combine."}, {"@type": "HowToStep", "text": "Whisk starter and 660 g room-temperature water in a large measuring glass to combine, then add oil and yeast and whisk until well blended."}, {"@type": "HowToStep", "text": "Make a well in dry ingredients and pour in starter mixture. Mix on low speed, increasing speed to medium as dry ingredients are incorporated, until well combined. Scrape down sides of bowl and fold in any flour, if needed. Remove bowl from mixer and scrape dough from hook. Cover bowl with plastic wrap; let dough rest at room temperature for 30 minutes."}, {"@type": "HowToStep", "text": "Uncover dough and fit bowl back onto mixer. Mix on medium speed until you're able to pinch and stretch a small piece of dough between your fingers until translucent and doesn’t rip, about 10 minutes (dough should look sticky but cohesive, and it should be very elastic and jiggly). Transfer dough to a very large bowl, cover tightly with plastic wrap, and let rise in a warm, draft-free spot (near the oven is great) until 50 percent expanded in volume, about 3 hours."}, {"@type": "HowToStep", "text": "Turn out dough onto a lightly floured surface. Lightly flour your hands, scale, bench scraper, and 2 small rimmed baking sheets."}, {"@type": "HowToStep", "text": "Divide dough into 200 g portions. Working one at a time, form each portion into a tight, even ball, rotating on counter and tucking under and pinching on bottom of ball to seal. Try to handle the ball as little as possible to keep dough from deflating. Using bench scraper, place balls seam side down on floured baking sheets, spacing evenly apart. Lightly sprinkle dough with some flour and cover baking sheets tightly with plastic as you go. Chill at least 24 hours and up to 48 before using."}, {"@type": "HowToStep", "text": "Do Ahead: Dough can be made 2 weeks ahead. Wrap balls tightly with plastic wrap and freeze. Let thaw in refrigerator overnight. Note: The frozen dough won't bake with as many bubbles or be as light as the fresh dough. It might also be stickier and harder to work with. Because of the idiosyncrasies of using starter, the success of using frozen dough will vary."}, {"@type": "HowToStep", "text": "Place tomatoes (without juice from can) in a colander to drain. Pass tomatoes through a food mill (using the medium disk) into a medium bowl (you should have about 2 cups purée). Mix in garlic, oil, and salt. Let sit at least 30 minutes before using."}, {"@type": "HowToStep", "text": "Do Ahead: Sauce can be made 2 days ahead. Cover and chill."}, {"@type": "HowToStep", "text": "Preheat a Breville Pizzaiolo oven to 700°. Place mozzarella and fior di latte in a fine-mesh sieve set over a medium bowl and let sit 30 minutes to drain."}, {"@type": "HowToStep", "text": "Drizzle a little oil in a large skillet and swirl pan to lightly coat. Heat over medium-high. Add mushrooms in a single layer and cook, undisturbed, until lightly browned underneath and starting to soften, about 3 minutes. Season with salt and pepper and toss mushrooms. Continue to cook, tossing occasionally, until lightly browned all over and softened, about 3 minutes more. Remove from heat and set aside."}, {"@type": "HowToStep", "text": "Place chiles in a small bowl and mix in just enough oil to make a tight sauce; set aside."}, {"@type": "HowToStep", "text": "Use a bench scraper to swiftly lift a ball of Pizza Dough from baking sheet, then invert it into a large bowl of flour, seam side up. Pass dough back and forth between your hands to knock off some flour. Place domed side up on work surface and use your fingertips to press dimples in dough, working from the center toward the outer edge and maintaining a circular shape. Stop dimpling 1\" before outer edge of dough (this will become the crust, and you want it to rise and puff higher than the center of the dough). After dimpling, stretch dough over the backs of your hands, moving in a circular pattern to create a 10\" round. Place onto very lightly floured peel."}, {"@type": "HowToStep", "text": "Spoon Pizza Sauce onto center of dough. Working in a spiral from the center outward, use spoon to spread sauce all the way to the inner edge of the crust."}, {"@type": "HowToStep", "text": "Top pizza with drained mozzarella and fior di latte, then garlic. Scatter several pieces of reserved mushroom around and sprinkle 1 Tbsp. Parmesan over. Slide pizza into oven and cook, rotating halfway through, until crust is puffed and charred in spots, cheese is melted, and underside of crust is golden brown with some darker leopard spots, 3 minutes. Remove pizza from oven. Drizzle with reserved chile sauce and sprinkle with another 1½ tsp. Parmesan. Arrange basil on top and finely grate a light dusting of lemon zest over."}], "totalTime": "None", "slug": "bon-appetit-s-perfect-pizza", "categories": [], "tags": [], "dateAdded": "{TinyDate}:20210112", "notes": [], "rating": 3, "orgURL": "https://www.bonappetit.com/recipe/perfect-pizza", "extras": {}}, "40": {"name": "Braised Beans and Sardines With Fennel", "description": "Tinned sardines add briney flavor (and protein!)—leave them whole or break them up and fold them into the soup.", "image": "braised-beans-and-sardines-with-fennel.jpg", "recipeYield": "4 servings", "recipeIngredient": ["1 fennel bulb with fronds, stalks and fronds removed", "1 lemon, halved", "¼ cup extra-virgin olive oil", "2 medium shallots, thinly sliced", "6 garlic cloves, thinly sliced", "Small handful of mixed hardy herb sprigs (such as bay leaves, thyme, and/or rosemary)", "½ tsp. crushed red pepper flakes", "¼ cup dry white wine", "6 cups low-sodium chicken broth", "2 15-oz. cans cannellini (white kidney) or cranberry beans, rinsed1 4.4-oz. tin oil-packed sardines, drained", "1 (loosely packed) cup very coarsely chopped parsley", "Kosher salt", "Toasted seeded bread (for serving)"], "recipeInstructions": [{"text": "Slice fennel bulb in half lengthwise and cut each half lengthwise into 3 wedges. Thinly slice 1 lemon half into rounds and wriggle out and discard any seeds; leave remaining half intact and set aside."}, {"text": "Heat oil in a medium pot over medium-high. Add fennel, shallots, garlic, hardy herbs, lemon rounds, and red pepper flakes and cook, stirring occasionally, until fennel and lemon are softened slightly and golden brown in spots, 5–7 minutes."}, {"text": "Using tongs, transfer lemon rounds to a small bowl; set aside. Add wine to pot and cook until reduced by half, about  2 minutes. Pour in broth and bring to a boil. Reduce heat to medium-low and simmer, stirring occasionally, until fennel is tender, about 5 minutes. Add beans and simmer until beans soak up some of the broth and are warmed through, 8–10 minutes."}, {"text": "Meanwhile, working one at a time, slice open each sardine with the tip of a paring knife and remove any visible bones; discard. Separate fillets from one another and place in a small bowl. Squeeze juice from remaining reserved lemon half over fillets."}, {"text": "Fish out and discard any hardy herbs and stems you can from braise. Stir in parsley; taste and season broth with more salt if needed."}, {"text": "Divide braise among bowls; top with reserved lemon slices and sardines. Serve with bread alongside."}], "totalTime": "None", "slug": "braised-beans-and-sardines-with-fennel", "categories": [], "tags": [], "dateAdded": "{TinyDate}:20210111", "notes": [], "rating": 0, "orgURL": "https://www.bonappetit.com/recipe/braised-beans-and-sardines-with-fennel", "extras": {}}, "41": {"name": "Corn and Crab Beignets With Yaji Aioli", "description": "This ode to chef BJ Dennis and Gullah Geechee cuisine marries crabmeat with corn kernels for a crispy party starter. ", "image": "corn-and-crab-beignets-with-yaji-aioli.jpg", "recipeYield": "8 - 10 Servings", "recipeIngredient": ["½ cup unsalted dry-roasted peanuts", "2 Tbsp. ground ginger", "1 tsp. cayenne pepper", "1 tsp. Diamond Crystal or ½ tsp. Morton kosher salt", "1 tsp. garlic powder", "1 tsp. onion powder", "1 tsp. paprika", "2 large egg yolks*", "1 Tbsp. fresh lemon juice", "¾ cup peanut oil", "1 small shallot, finely chopped", "1 garlic clove, finely grated", "2 Tbsp. thinly sliced chives", "Kosher salt", "4 Tbsp. unsalted butter", "10 oz. frozen corn (about 2 cups)", "2 Tbsp. thinly sliced chives", "1½ cups all-purpose flour", "½ cup cornmeal", "2 tsp. baking powder", "1½ tsp. Diamond Crystal or ¾ tsp. Morton kosher salt", "½ tsp. cayenne pepper", "1 large egg, beaten to blend", "1 cup buttermilk", "8 oz. lump crabmeat, picked over", "Vegetable oil (for frying; about 6 cups)", "* Raw egg is not recommended for the elderly, pregnant women, people with weakened immune systems…or people who don’t like raw egg.", "A deep-fry thermometer"], "recipeInstructions": [{"@type": "HowToStep", "text": "Pulse peanuts in a food processor until very finely chopped (be careful not to go too far; if you overprocess, the peanuts will turn into butter). Add ginger, cayenne, salt, garlic powder, onion powder, and paprika and pulse until powderlike.\nDo ahead: Yaji can be made 3 months ahead. Transfer to an airtight container; cover and chill or freeze."}, {"@type": "HowToStep", "text": "Whisk egg yolks and lemon juice in a medium bowl to combine. Whisking constantly, add oil, starting with just a few drops at a time and gradually increasing to a fine steady stream. Whisk until all of the oil is incorporated and mixture is emulsified, about 4 minutes. Whisk in shallot, garlic, chives, and 1 Tbsp. yaji spice blend. Taste and season with salt.\nDo ahead: Aioli can be made 3 days ahead. Cover and chill."}, {"@type": "HowToStep", "text": "Melt butter in a medium high-sided skillet over medium heat. Add corn and cook, stirring occasionally, until softened slightly and bright yellow, about 5 minutes. Transfer to a large bowl and stir in chives; let cool."}, {"@type": "HowToStep", "text": "Meanwhile, whisk flour, cornmeal, baking powder, salt, and cayenne in a medium bowl."}, {"@type": "HowToStep", "text": "Add egg and buttermilk to corn mixture and stir to combine. Add dry ingredients and stir again just to incorporate, then fold in crabmeat."}, {"@type": "HowToStep", "text": "Pour in oil to come 1½\" up sides of a large pot or deep fryer. Fit pot with thermometer and heat oil over medium-high to 350°. Place a wire rack inside a rimmed baking sheet and line rack with paper towels. Working in 4 or 5 batches, scoop out heaping tablespoons of batter, carefully place in oil (8–10 per batch) and fry, turning often, until beignets are golden brown and cooked through, about 5 minutes. Transfer beignets to prepared rack; season with salt."}, {"@type": "HowToStep", "text": "Serve beignets warm with yaji aioli for dipping."}], "totalTime": "None", "slug": "corn-and-crab-beignets-with-yaji-aioli", "categories": [], "tags": [], "dateAdded": "{TinyDate}:20210112", "notes": [], "rating": 5, "orgURL": "https://www.bonappetit.com/recipe/corn-and-crab-beignets-with-yaji-aioli", "extras": {}}}, "settings": {"1": {"name": "main", "webhooks": {"webhookTime": "00:00", "webhookURLs": [], "enabled": "false"}}}}