{"_default": {"3": {"name": "Chicken and Rice With Leeks and Salsa Verde", "description": "This one-skillet dinner gets deep oniony flavor from lots of leeks cooked down to jammy tenderness.", "image": "chicken-and-rice-with-leeks-and-salsa-verde.jpg", "recipeYield": "4 Servings", "recipeIngredient": ["1½ lb. skinless, boneless chicken thighs (4–8 depending on size)", "Kosher salt, freshly ground pepper", "3 Tbsp. unsalted butter, divided", "2 large or 3 medium leeks, white and pale green parts only, halved lengthwise, thinly sliced", "Zest and juice of 1 lemon, divided", "1½ cups long-grain white rice, rinsed until water runs clear", "2¾ cups low-sodium chicken broth", "1 oil-packed anchovy fillet", "2 garlic cloves", "1 Tbsp. drained capers", "Crushed red pepper flakes", "1 cup tender herb leaves (such as parsley, cilantro, and/or mint)", "4–5 Tbsp. extra-virgin olive oil"], "recipeInstructions": [{"text": "Season chicken with salt and pepper. Melt 2 Tbsp. butter in a large high-sided skillet over medium-high heat. Add leeks and half of lemon zest, season with salt and pepper, and mix to coat leeks in butter. Reduce heat to medium-low, cover, and cook, stirring occasionally, until leeks are somewhat tender, about 5 minutes. Remove lid, increase heat to medium-high, and cook, stirring occasionally, until tender and just starting to take on color, about 3 minutes. Add rice and cook, stirring often, 3 minutes, then add broth, scraping up any browned bits. Tuck short sides of each chicken thigh underneath so they are touching and nestle seam side down into rice mixture. Bring to a simmer. Cover, reduce heat to medium-low, and cook until rice is tender and chicken is cooked through, about 20 minutes. Remove from heat. Cut remaining 1 Tbsp. butter into small pieces and scatter over mixture. Re-cover and let sit 10 minutes."}, {"text": "Meanwhile, pulse anchovy, garlic, capers, a few pinches of red pepper flakes, and remaining lemon zest in a food processor until finely chopped. Add herbs; process until a paste forms. With motor running, gradually stream in oil until loosened to a thick sauce. Add half of lemon juice; season salsa verde with salt."}, {"text": "Drizzle remaining lemon juice over chicken and rice. Serve with salsa verde."}], "totalTime": "None", "slug": "chicken-and-rice-with-leeks-and-salsa-verde", "categories": [], "tags": [], "dateAdded": null, "notes": [], "rating": null, "orgURL": "https://www.bonappetit.com/recipe/chicken-and-rice-with-leeks-and-salsa-verde", "extras": {}}}}